MikroElektronika/core_packages/ARM/gcc_clang/system/src/nuvoton/m254/thirdparty/m254/uuart_reg.h
#define UUART_CTL_FUNMODE_Pos             (0)                                               /*!< UUART_T::CTL: FUNMODE Position          */
#define UUART_CTL_FUNMODE_Msk             (0x7ul << UUART_CTL_FUNMODE_Pos)                  /*!< UUART_T::CTL: FUNMODE Mask              */

#define UUART_INTEN_TXSTIEN_Pos           (1)                                               /*!< UUART_T::INTEN: TXSTIEN Position        */
#define UUART_INTEN_TXSTIEN_Msk           (0x1ul << UUART_INTEN_TXSTIEN_Pos)                /*!< UUART_T::INTEN: TXSTIEN Mask            */

#define UUART_INTEN_TXENDIEN_Pos          (2)                                               /*!< UUART_T::INTEN: TXENDIEN Position       */
#define UUART_INTEN_TXENDIEN_Msk          (0x1ul << UUART_INTEN_TXENDIEN_Pos)               /*!< UUART_T::INTEN: TXENDIEN Mask           */

#define UUART_INTEN_RXSTIEN_Pos           (3)                                               /*!< UUART_T::INTEN: RXSTIEN Position        */
#define UUART_INTEN_RXSTIEN_Msk           (0x1ul << UUART_INTEN_RXSTIEN_Pos)                /*!< UUART_T::INTEN: RXSTIEN Mask            */

#define UUART_INTEN_RXENDIEN_Pos          (4)                                               /*!< UUART_T::INTEN: RXENDIEN Position       */
#define UUART_INTEN_RXENDIEN_Msk          (0x1ul << UUART_INTEN_RXENDIEN_Pos)               /*!< UUART_T::INTEN: RXENDIEN Mask           */

#define UUART_BRGEN_RCLKSEL_Pos           (0)                                               /*!< UUART_T::BRGEN: RCLKSEL Position        */
#define UUART_BRGEN_RCLKSEL_Msk           (0x1ul << UUART_BRGEN_RCLKSEL_Pos)                /*!< UUART_T::BRGEN: RCLKSEL Mask            */

#define UUART_BRGEN_PTCLKSEL_Pos          (1)                                               /*!< UUART_T::BRGEN: PTCLKSEL Position       */
#define UUART_BRGEN_PTCLKSEL_Msk          (0x1ul << UUART_BRGEN_PTCLKSEL_Pos)               /*!< UUART_T::BRGEN: PTCLKSEL Mask           */

#define UUART_BRGEN_SPCLKSEL_Pos          (2)                                               /*!< UUART_T::BRGEN: SPCLKSEL Position       */
#define UUART_BRGEN_SPCLKSEL_Msk          (0x3ul << UUART_BRGEN_SPCLKSEL_Pos)               /*!< UUART_T::BRGEN: SPCLKSEL Mask           */

#define UUART_BRGEN_TMCNTEN_Pos           (4)                                               /*!< UUART_T::BRGEN: TMCNTEN Position        */
#define UUART_BRGEN_TMCNTEN_Msk           (0x1ul << UUART_BRGEN_TMCNTEN_Pos)                /*!< UUART_T::BRGEN: TMCNTEN Mask            */

#define UUART_BRGEN_TMCNTSRC_Pos          (5)                                               /*!< UUART_T::BRGEN: TMCNTSRC Position       */
#define UUART_BRGEN_TMCNTSRC_Msk          (0x1ul << UUART_BRGEN_TMCNTSRC_Pos)               /*!< UUART_T::BRGEN: TMCNTSRC Mask           */

#define UUART_BRGEN_PDSCNT_Pos            (8)                                               /*!< UUART_T::BRGEN: PDSCNT Position         */
#define UUART_BRGEN_PDSCNT_Msk            (0x3ul << UUART_BRGEN_PDSCNT_Pos)                 /*!< UUART_T::BRGEN: PDSCNT Mask             */

#define UUART_BRGEN_DSCNT_Pos             (10)                                              /*!< UUART_T::BRGEN: DSCNT Position          */
#define UUART_BRGEN_DSCNT_Msk             (0x1ful << UUART_BRGEN_DSCNT_Pos)                 /*!< UUART_T::BRGEN: DSCNT Mask              */

#define UUART_BRGEN_CLKDIV_Pos            (16)                                              /*!< UUART_T::BRGEN: CLKDIV Position         */
#define UUART_BRGEN_CLKDIV_Msk            (0x3fful << UUART_BRGEN_CLKDIV_Pos)               /*!< UUART_T::BRGEN: CLKDIV Mask             */

#define UUART_DATIN0_SYNCSEL_Pos          (0)                                               /*!< UUART_T::DATIN0: SYNCSEL Position       */
#define UUART_DATIN0_SYNCSEL_Msk          (0x1ul << UUART_DATIN0_SYNCSEL_Pos)               /*!< UUART_T::DATIN0: SYNCSEL Mask           */

#define UUART_DATIN0_ININV_Pos            (2)                                               /*!< UUART_T::DATIN0: ININV Position         */
#define UUART_DATIN0_ININV_Msk            (0x1ul << UUART_DATIN0_ININV_Pos)                 /*!< UUART_T::DATIN0: ININV Mask             */

#define UUART_DATIN0_EDGEDET_Pos          (3)                                               /*!< UUART_T::DATIN0: EDGEDET Position       */
#define UUART_DATIN0_EDGEDET_Msk          (0x3ul << UUART_DATIN0_EDGEDET_Pos)               /*!< UUART_T::DATIN0: EDGEDET Mask           */

#define UUART_CTLIN0_SYNCSEL_Pos          (0)                                               /*!< UUART_T::CTLIN0: SYNCSEL Position       */
#define UUART_CTLIN0_SYNCSEL_Msk          (0x1ul << UUART_CTLIN0_SYNCSEL_Pos)               /*!< UUART_T::CTLIN0: SYNCSEL Mask           */

#define UUART_CTLIN0_ININV_Pos            (2)                                               /*!< UUART_T::CTLIN0: ININV Position         */
#define UUART_CTLIN0_ININV_Msk            (0x1ul << UUART_CTLIN0_ININV_Pos)                 /*!< UUART_T::CTLIN0: ININV Mask             */

#define UUART_CLKIN_SYNCSEL_Pos           (0)                                               /*!< UUART_T::CLKIN: SYNCSEL Position        */
#define UUART_CLKIN_SYNCSEL_Msk           (0x1ul << UUART_CLKIN_SYNCSEL_Pos)                /*!< UUART_T::CLKIN: SYNCSEL Mask            */

#define UUART_LINECTL_LSB_Pos             (0)                                               /*!< UUART_T::LINECTL: LSB Position          */
#define UUART_LINECTL_LSB_Msk             (0x1ul << UUART_LINECTL_LSB_Pos)                  /*!< UUART_T::LINECTL: LSB Mask              */

#define UUART_LINECTL_DATOINV_Pos         (5)                                               /*!< UUART_T::LINECTL: DATOINV Position      */
#define UUART_LINECTL_DATOINV_Msk         (0x1ul << UUART_LINECTL_DATOINV_Pos)              /*!< UUART_T::LINECTL: DATOINV Mask          */

#define UUART_LINECTL_CTLOINV_Pos         (7)                                               /*!< UUART_T::LINECTL: CTLOINV Position      */
#define UUART_LINECTL_CTLOINV_Msk         (0x1ul << UUART_LINECTL_CTLOINV_Pos)              /*!< UUART_T::LINECTL: CTLOINV Mask          */

#define UUART_LINECTL_DWIDTH_Pos          (8)                                               /*!< UUART_T::LINECTL: DWIDTH Position       */
#define UUART_LINECTL_DWIDTH_Msk          (0xful << UUART_LINECTL_DWIDTH_Pos)               /*!< UUART_T::LINECTL: DWIDTH Mask           */

